In [0]:
import json
from types import SimpleNamespace
import pandas as pd
import rich

In [0]:
import requests

headers = {
    'authority': '10digi.com',
    'sec-ch-ua': '"Google Chrome";v="93", " Not;A Brand";v="99", "Chromium";v="93"',
    'accept': 'application/json, text/plain, */*',
    'content-type': 'application/json;charset=UTF-8',
    'accept-language': 'en-GB,en-US;q=0.9,en;q=0.8',
    'sec-ch-ua-mobile': '?0',
    'user-agent': 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/93.0.4577.82 Safari/537.36',
    'sec-ch-ua-platform': '"Windows"',
    'origin': 'https://10digi.com',
    'sec-fetch-site': 'same-origin',
    'sec-fetch-mode': 'cors',
    'sec-fetch-dest': 'empty',
    'referer': 'https://10digi.com/fancy-number/search/?term=7305500731&sid=477929',
    'cookie': '_gcl_au=1.1.1692264640.1632140588; SL_C_23361dd035530_KEY=605b54c5ca7ce860b7dd00fbd27964dc1ab0b475; _ga=GA1.2.2035690568.1632140601; _hjid=67bf66e1-b8b1-4f36-823b-3772d83ba61c; _fbp=fb.1.1632140602027.679858302; _scid=E2yAO-Hp-t2Up3lkILYyru0dJhzDIRurtyjQWwMdwdrgVAnoZ7YZnYFTIV89Ap5dTiiG5kLlVZzVdpzVgS63R3RkaERfdTZvdGxTRmduUzZmNEtzUkpjWGF3NHZZbUR0aFFpVVFsZDBTWWc; _hjShownFeedbackMessage=true; _gid=GA1.2.2098240921.1632379395; _hjAbsoluteSessionInProgress=0; SL_C_23361dd035530_VID=9da3NkQYSv; _uetsid=85df0f601c3911ec8f702db750669134; _uetvid=86be24601a0d11eca09ffdf7825808a9',
}

data = '{"filters":{"term":"","search_id":"477929","after":"false","limit":10000}}'
response = requests.post('https://10digi.com/api/v2/numbers/list', headers=headers, data=data)

In [27]:
content = json.loads(response.content)

In [ ]:
data = SimpleNamespace(**content)nums = data.data['list']

In [31]:
df = pd.DataFrame({"number":[x["number"] for x in nums]})

In [32]:
df.size

302

# Two numbers repeating at least once

In [33]:
df[df["number"].astype(str).str.match(r".*(\d{2}).*\1")]

         number
3    7305656385
17   7358435928
24   7305817385
31   7305867385
43   7305307925
..          ...
273  7305627341
275  7305630341
282  7358407084
287  7358087084
296  7200404770

[62 rows x 1 columns]

# Two numbers repeating more than once

In [34]:
df[df["number"].astype(str).str.match(r".*(\d{2}).*\1.*\1.*")]

Empty DataFrame
Columns: [number]
Index: []

# Starting two numbers repeated anywhere

In [35]:
df[df["number"].astype(str).str.match(r"^(\d{2}).*\1")]

         number
24   7305817385
31   7305867385
68   7338985873
69   7305545873
73   7305823873
74   7305833873
75   7305839873
76   7305857873
77   7305860873
78   7305891873
79   7305920873
80   7305934873
81   7338948873
82   7305057873
122  7305739585
140  7305687303
141  7305897303
151  7305739303
179  7305731458
183  7305397385
187  7358647385
250  7305473341
260  7397363847
273  7305627341

# Starting and ending 3 numbers are same

In [36]:
df[df["number"].astype(str).str.match(r"^(\d{3}).*\1$")]

Empty DataFrame
Columns: [number]
Index: []

# Starting 3 numbers repeated at least once

In [37]:
df[df["number"].astype(str).str.match(r"^(\d{3}).*\1.*")]

         number
140  7305687303
141  7305897303

# Any 3 numbers repeated once

In [38]:
df[df["number"].astype(str).str.match(r".*(\d{3}).*\1.*")]

         number
124  7305810585
136  6385109385
140  7305687303
141  7305897303

# Any number repeated at least 4 times

In [39]:
df[df["number"].astype(str).str.match(r".*(\d).*\1.*\1.*\1.*")]

         number
4    7305336834
58   7358364833
59   7305431833
60   7358432833
62   7305623833
63   7305632833
74   7305833873
143  7305493303
151  7305739303
180  7305755458
193  7305313385
220  7358363385
238  7305458755
249  7305323341
293  7305271770
296  7200404770

# Any number repeated at least 5 times

In [40]:
df[df["number"].astype(str).str.match(r".*(\d).*\1.*\1.*\1.*\1.*")]

Empty DataFrame
Columns: [number]
Index: []

# Any triple numbers

In [41]:
df[df["number"].astype(str).str.match(r".*(\d)\1\1.*")]

         number
300  7305553770

# Any quadruple numbers

In [42]:
df[df["number"].astype(str).str.match(r".*(\d)\1\1\1.*")]

Empty DataFrame
Columns: [number]
Index: []

# Any double numbers repeating

In [43]:
df[df["number"].astype(str).str.match(r".*(\d)(\1).*\1\2.*")]

Empty DataFrame
Columns: [number]
Index: []

# More than one set of double digit numbers

In [44]:
df[df["number"].astype(str).str.match(r".*(\d)\1.*(\d)\2.*")]

         number
18   7200455928
81   7338948873
87   7338837028
88   7200377028
95   7338992151
97   7305544028
134  7338991385
153  7305526744
154  7305563744
162  7338795744
200  7338980998
208  7338923966
211  7200143966
239  7200549755
244  7338938847
245  7338948847
296  7200404770
300  7305553770
301  7305562770

# One triple and one double number

In [45]:
df[df["number"].astype(str).str.match(r".*(\d)\1\1.*(\d)\2.*")]

         number
300  7305553770

# Middle two numbers are double digit

In [46]:
df[df["number"].astype(str).str.match(r"^\d{4}(\d)\1\d{4}")]

         number
4    7305336834
85   7305667028
95   7338992151
105  7305664028
134  7338991385
135  7305009385
142  8015117303
258  7305337847
300  7305553770

# Match 4 numbers in sequence

In [47]:
df[df["number"].astype(str).str.match(r"(0123|1234|2345|3456|4567|5678|6789)")]

Empty DataFrame
Columns: [number]
Index: []

# Match 3 numbers in sequence

In [48]:
df[df["number"].astype(str).str.match(r"(012|123|234|345|456|567|678|789)")]

Empty DataFrame
Columns: [number]
Index: []